[
  {
    "artistImage": "http://i.imgur.com/kOelxOc.jpg",
    "birthdate": "1972-10-17",
    "birthplace": "Detroit, MI",
    "cleanUrlName": "eminem",
    "realName": "Marshall Mathers",
    "releases": [
      {
        "amazonUrl": "",
        "iTunesUrl": "",
        "mixtapeUrl": "",
        "rank": 1,
        "releaseName": "Infinite",
        "releaseType": "Album",
        "releaseYear": "1996",
        "spotifyUrl": "",
        "description": "Infinite is the solo debut album of American rapper Eminem, released August 10, 1996, through Web Entertainment. The album was recorded at the Bass Brothers' studio, known as the 'Bassmint' and produced by Mr. Porter, Proof and Peter Schorn. It features vocals from fellow rappers Proof, Mr. Porter, Eye-Kyu, Three and Thyme. The album sold only about 1,000 copies, and received rare reviews, which were mixed, mainly criticizing the album's production but praising Eminem's lyrical ability. Copies of the album are generally valued at $130–$200 due to the rarity and low production of the album. While Eminem's future albums would prove more successful, the rapper still gained some recognition for his debut effort."
      },
      {
        "amazonUrl": "http://www.amazon.com/The-Slim-Shady-LP-Eminem/dp/B00000I5JQ",
        "iTunesUrl": "https://itunes.apple.com/us/album/the-slim-shady-lp/id360678",
        "mixtapeUrl": "",
        "rank": 2,
        "releaseName": "The Slim Shady LP",
        "releaseType": "Album",
        "releaseYear": "1999",
        "spotifyUrl": "https://play.spotify.com/album/0JnN0ZgNrYxz3Gk725HiAd",
        "description": "The Slim Shady LP is the second studio album and first major release from the American rapper Eminem. It was released on February 23, 1999, under Web Records and Dr. Dre's Aftermath Entertainment. Recorded in Ferndale, Michigan. following Eminem's recruitment by Dr. Dre and Jimmy Iovine, the album features production from Dr. Dre, the Bass Brothers, and Eminem himself. The majority of the record's lyrical content is written from the perspective of the rapper's alter ego Slim Shady, whom the rapper created on The Slim Shady EP (1997). The record won a Grammy Award for Best Rap Album, and in 2003, the album was ranked number 273 on Rolling Stone magazine's list of the 500 greatest albums of all time."
      },
      {
        "amazonUrl": "http://www.amazon.com/The-Marshall-Mathers-LP-Eminem/dp/B00004T9UF",
        "iTunesUrl": "https://itunes.apple.com/us/album/the-marshall-mathers-lp/id362114",
        "mixtapeUrl": "",
        "rank": 3,
        "releaseName": "The Marshall Mathers LP",
        "releaseType": "Album",
        "releaseYear": "2000",
        "spotifyUrl": "https://play.spotify.com/album/6t7956yu5zYf5A829XRiHC",
        "description": "The Marshall Mathers LP is the third studio album by American rapper Eminem. It was released on May 23, 2000, by Interscope Records in the United States, and on September 11, 2000, by Polydor Records in the United Kingdom. The Marshall Mathers LP has been ranked as one of the greatest hip hop albums of all time by Rolling Stone, Time, and XXL. Rolling Stone placed the album at number 7 on its list of the best albums of the 2000s.The album was ranked number 244 by Rolling Stone on their list of The 500 Greatest Albums of All Time."
      },
      {
        "amazonUrl": "http://www.amazon.com/The-Eminem-Show/dp/B00006690G",
        "iTunesUrl": "https://itunes.apple.com/us/album/the-eminem-show/id111092",
        "mixtapeUrl": "",
        "rank": 4,
        "releaseName": "The Eminem Show",
        "releaseType": "Album",
        "releaseYear": "2002",
        "spotifyUrl": "https://play.spotify.com/album/1ftvBBcu7jYIvXyt3JWB8S",
        "description": "The Eminem Show is the fourth studio album by American rapper Eminem, released on May 28, 2002. It was the best-selling album of 2002 in the United States, with sales of 7.6 million copies. At the 2003 Grammy Awards it was nominated for Album of the Year and became Eminem's third LP in four years to win the award for Best Rap Album. In 2009, the album was ranked #317 on Rolling Stone's list of the 500 greatest albums of all time, and was later ranked at #84 on the same magazine's best albums of the 2000s decade. The album received critical praise by most music critics and is often debated as Eminem's most personal and best work. Eminem himself acknowledged during an interview with MTV that was recorded on May 25, 2002, that he felt that The Eminem Show was his best record so far."
      },
      {
        "amazonUrl": "http://www.amazon.com/Encore-Deluxe-Edition-Eminem/dp/B00065XJ52",
        "iTunesUrl": "https://itunes.apple.com/us/album/encore-deluxe-version/id28690630",
        "mixtapeUrl": "",
        "rank": 5,
        "releaseName": "Encore",
        "releaseType": "Album",
        "releaseYear": "2004",
        "spotifyUrl": "https://play.spotify.com/album/2k6lJkGsEEHhBOEPObe6Uq",
        "description": "Encore is the fifth studio album by American rapper Eminem. Encore sold 710,000 copies in its first three days. Critical reception was generally positive. However, most critics and fans alike did note the subpar quality of the lyrics, which were more simplistic when compared to his previous albums. The album was nominated for three Grammys at the 48th Annual Grammy Awards including for Best Rap Album but lost to Kanye West's Late Registration. The album made digital history in becoming the first album to sell 10,000 digital copies in one week."
      },
      {
        "amazonUrl": "http://www.amazon.com/Relapse-Eminem/dp/B00192M9FC",
        "iTunesUrl": "https://itunes.apple.com/us/album/relapse/id315867000",
        "mixtapeUrl": "",
        "rank": 6,
        "releaseName": "Relapse",
        "releaseType": "Album",
        "releaseYear": "2009",
        "spotifyUrl": "https://play.spotify.com/album/0dSi4mEwlCG6cSfWLT6rZG",
        "description": "Relapse is the sixth studio album by American rapper Eminem, released on May 15, 2009 by Interscope Records. It was his first album of original material since Encore (2004), following a four-year hiatus from recording due to his writer's block and an addiction to prescription sleeping medication. One of the most anticipated album releases of 2009, Relapse debuted at number one on the US Billboard 200 chart, selling 608,000 copies in its first week."
      },
      {
        "amazonUrl": "http://www.amazon.com/Recovery-Eminem/dp/B003KUSUG8",
        "iTunesUrl": "https://itunes.apple.com/us/album/recovery-deluxe-edition/id378423506",
        "mixtapeUrl": "",
        "rank": 7,
        "releaseName": "Recovery",
        "releaseType": "Album",
        "releaseYear": "2010",
        "spotifyUrl": "https://play.spotify.com/album/3PogVmhNucYNfyywZvTd7F",
        "description": "Recovery is the seventh studio album by American rapper Eminem. It was released on June 18, 2010, by Shady Records, Aftermath Entertainment and Interscope Records as the follow-up to Eminem's Relapse (2009). The album received generally positive reviews from music critics, who complimented Eminem's rapping and performance on the album, although some criticized its inconsistency and production. Recovery debuted at number one on the US Billboard 200 chart, selling 741,000 copies in its first week and stayed at number one for seven non-consecutive weeks."
      },
      {
        "amazonUrl": "http://www.amazon.com/The-Marshall-Mathers-LP2-Deluxe/dp/B00FKAA3MA",
        "iTunesUrl": "https://itunes.apple.com/us/album/marshall-mathers-lp2-deluxe/id731756766",
        "mixtapeUrl": "",
        "rank": 8,
        "releaseName": "The Marshall Mathers LP 2",
        "releaseType": "Album",
        "releaseYear": "2013",
        "spotifyUrl": "https://play.spotify.com/album/6DN7GcZF1HywzrkGN6Eeqk",
        "description": "The Marshall Mathers LP 2 is the eighth studio album by American rapper Eminem, released on November 5, 2013, by Aftermath Entertainment, Shady Records, and Interscope Records. Production for the album took place from 2012 to 2013 and was handled by Eminem and other record producers, including Rick Rubin, Luis Resto, Emile Haynie, and Alex da Kid. The album received generally positive reviews from music critics, with praise going to Eminem's technical rapping skill and production choices. It was Eminem's best-reviewed album at Metacritic since The Eminem Show (2002)."
      }
    ],
    "stageName": "Eminem",
    "twitterUsername": "Eminem",
    "website": "http://eminem.com"
  },
  {
    "artistImage": "http://i.imgur.com/Ikbyzrz.jpg",
    "birthdate": "1987-06-17",
    "birthplace": "Compton, CA",
    "cleanUrlName": "kendrick-lamar",
    "realName": "Kendrick Lamar Duckworth",
    "releases": [
      {
        "amazonUrl": "",
        "iTunesUrl": "",
        "mixtapeUrl": "http://www.datpiff.com/Kendrick-Lamar-Kendrick-Lamar-EP-mixtape.308308.html",
        "rank": 1,
        "releaseName": "Kendrick Lamar EP",
        "releaseType": "Mixtape",
        "releaseYear": "2009",
        "spotifyUrl": "",
        "description": "The Kendrick Lamar EP features fifteen tracks featuring artists such as JAY ROCK, AB SOUL, SCHOOLBOY Q, Big Pooh, BJ The Chicago Kid, Punch, Javonte, Interlude, and Angela McCluskey.  This is the third installment of mixtapes from Kendrick Lamar after his first two were under his stage name K.Dot.  Dr. Dre has been credited for calling Kendrick out for K.Dot and to change his name to Kendrick Lamar."
      },
      {
        "amazonUrl": "http://www.amazon.com/Section-80-Kendrick-Lamar/dp/B005AJ8A94",
        "iTunesUrl": "https://itunes.apple.com/us/album/section.80/id447516359",
        "mixtapeUrl": "",
        "rank": 2,
        "releaseName": "Section.80",
        "releaseType": "Album",
        "releaseYear": "2011",
        "spotifyUrl": "https://play.spotify.com/album/13WjgUEEAQp0d9JqojlWp1",
        "description": "Section.80 is the debut studio album by American hip hop recording artist Kendrick Lamar, released exclusively through the iTunes Store on July 2, 2011, under Top Dawg Entertainment. The concept album features lyrical themes delivered by Lamar such as racism and medication tolerance, and was well received by contemporary music critics."
      },
      {
        "amazonUrl": "http://www.amazon.com/Good-Kid-M-A-A-D-Kendrick-Lamar/dp/B0090X4HES",
        "iTunesUrl": "https://itunes.apple.com/us/album/good-kid-m.a.a.d.-city-deluxe/id622710488",
        "mixtapeUrl": "",
        "rank": 3,
        "releaseName": "Good Kid, M.A.A.D City",
        "releaseType": "Album",
        "releaseYear": "2012",
        "spotifyUrl": "https://play.spotify.com/album/1DqhWr73Fh5yoNzKLas0G3",
        "description": "Good Kid, M.A.A.D City (stylized as good kid, m.A.A.d city) is the second studio album by American rapper Kendrick Lamar. The album was released on October 22, 2012, by Top Dawg Entertainment, Aftermath Entertainment, and was distributed by Interscope Records. The album serves as Lamar's major label debut, after his signing to Aftermath and Interscope in early 2012. Upon its release, Good Kid, M.A.A.D City received rave reviews from music critics, who praised its thematic scope and Lamar's lyrics."
      },
      {
        "amazonUrl": "http://www.amazon.com/Overly-Dedicated-Explicit-Kendrick-Lamar/dp/B004332E2M",
        "iTunesUrl": "https://itunes.apple.com/us/album/overly-dedicated/id392386303",
        "mixtapeUrl": "http://www.datpiff.com/Kendrick-Lamar-Overly-Dedicated-mixtape.152921.html",
        "rank": 4,
        "releaseName": "Overly Dedicated",
        "releaseType": "Mixtape",
        "releaseYear": "2010",
        "spotifyUrl": "https://play.spotify.com/album/5wwQGuazQaPtxOddReACsV",
        "description": "Overly Dedicated (stylized O(verly) D(edicated) and often referred to as O.D.) is the fourth mixtape by American hip hop recording artist Kendrick Lamar, released September 14, 2010, via Top Dawg Entertainment. The album features guest appearances from Dash Snow, Jhené Aiko, Schoolboy Q, Ab-Soul, Dom Kennedy and MURS, among others."
      }      
    ],
    "stageName": "Kendrick Lamar",
    "twitterUsername": "kendricklamar",
    "website": "http://kendricklamar.com"
  },
  {
    "artistImage": "http://i.imgur.com/X3PAiuy.jpg",
    "birthdate": "1977-06-08",
    "birthplace": "Chicago, IL",
    "cleanUrlName": "kanye-west",
    "realName": "Kanye Omari West",
    "releases": [
      {
        "amazonUrl": "http://www.amazon.com/College-Dropout-Kanye-West/dp/B0001AP12G/",
        "iTunesUrl": "https://itunes.apple.com/us/album/the-college-dropout/id5926607",
        "mixtapeUrl": "",
        "rank": 1,
        "releaseName": "The College Dropout",
        "releaseType": "Album",
        "releaseYear": "2004",
        "spotifyUrl": "https://play.spotify.com/album/3ff2p3LnR6V7m6BinwhNaQ",
        "description": "The College Dropout is the debut album by American hip hop artist Kanye West, released February 10, 2004, on Roc-A-Fella Records. It was recorded over a period of four years, beginning in 1999. Prior to the album's release, West had worked on rapper Jay-Z's The Blueprint (2001), which showcased his melodic and soulful style of hip hop production. The production of the album was often halted by the lack of confidence that producers had in West's rapping ability, eventually being convinced based off the success of his early musical ventures. It is West's best-selling album in the United States, with domestic sales of over 3.1 million copies and worldwide sales of over four million copies. It has been named by Time and Rolling Stone as one of the greatest albums of all time and is often listed amongst the greatest debut albums ever released by a hip hop artist."
      },
      {
        "amazonUrl": "http://www.amazon.com/Late-Registration-Kanye-West/dp/B0009WPKY0",
        "iTunesUrl": "https://itunes.apple.com/us/album/late-registration/id79483267",
        "mixtapeUrl": "",
        "rank": 2,
        "releaseName": "Late Registration",
        "releaseType": "Album",
        "releaseYear": "2005",
        "spotifyUrl": "https://play.spotify.com/album/4GRDFQ9HRoO0by8H0r2a3I",
        "description": "Late Registration is the second studio album by American hip hop artist Kanye West, released on August 30, 2005, by Roc-A-Fella Records. Upon its release, Late Registration received rave reviews from music critics and earned West several accolades, including a Grammy Award for Best Rap Album at the 2006 Grammy Awards and an Album of the Year nomination. It appeared at the top of several publications year-end lists of top albums. Rolling Stone named it the best album of 2005, and included it at number 118 on its list of the 500 Greatest Albums of All Time in 2012."
      },
      {
        "amazonUrl": "http://www.amazon.com/Graduation-Kanye-West/dp/B000RG1FMO",
        "iTunesUrl": "https://itunes.apple.com/us/album/graduation/id401263134",
        "mixtapeUrl": "",
        "rank": 3,
        "releaseName": "Graduation",
        "releaseType": "Album",
        "releaseYear": "2007",
        "spotifyUrl": "https://play.spotify.com/album/0FnTw6TY6iB5AHATPzCYkd",
        "description": "Late Registration is the second studio album by American hip hop artist Kanye West, released on August 30, 2005, by Roc-A-Fella Records. Upon its release, Late Registration received rave reviews from music critics and earned West several accolades, including a Grammy Award for Best Rap Album at the 2006 Grammy Awards and an Album of the Year nomination. It appeared at the top of several publications year-end lists of top albums. Rolling Stone named it the best album of 2005, and included it at number 118 on its list of the 500 Greatest Albums of All Time in 2012."
      },
      {
        "amazonUrl": "http://www.amazon.com/808s-Heartbreak-Kanye-West/dp/B001FBIPFA",
        "iTunesUrl": "https://itunes.apple.com/us/album/808s-heartbreak-bonus-video/id297475377",
        "mixtapeUrl": "",
        "rank": 4,
        "releaseName": "808s & Heartbreak",
        "releaseType": "Album",
        "releaseYear": "2008",
        "spotifyUrl": "https://play.spotify.com/album/2JK89jt4unItFroOr0kT3g",
        "description": "808s & Heartbreak is the fourth studio album by American recording artist and producer Kanye West, released on November 24, 2008, by Roc-A-Fella Records. The album debuted at number one on the US Billboard 200 chart, selling 450,145 copies in its first week. Despite varying responses from music audiences towards West's stylistic change, 808s & Heartbreak received generally positive reviews from music critics upon its release. It was named one of the best albums of 2008 in several critics' polls and year-end lists. It also impacted hip hop music stylistically, as a new wave of rappers adopted the album's aesthetic. 808s & Heartbreak has been certified platinum by the Recording Industry Association of America and has sold 1,700,000 copies in the United States."
      },
      {
        "amazonUrl": "http://www.amazon.com/808s-Heartbreak-Kanye-West/dp/B001FBIPFA",
        "iTunesUrl": "https://itunes.apple.com/gb/album/808s-heartbreak/id296840012",
        "mixtapeUrl": "",
        "rank": 5,
        "releaseName": "MBDTF",
        "releaseType": "Album",
        "releaseYear": "2010",
        "spotifyUrl": "https://play.spotify.com/album/2JK89jt4unItFroOr0kT3g",
        "description": "My Beautiful Dark Twisted Fantasy is the fifth studio album by American hip hop recording artist Kanye West, released November 22, 2010, on Roc-A-Fella Records. Upon its release, My Beautiful Dark Twisted Fantasy received rave reviews from music critics, some of whom viewed it as West's best work. Critics praised its ambitious musical range, opulent production style, and West's dichotomous themes. In their year-end lists, the album was critics' consensus pick for best album of 2010. Although its omission from the Grammy Awards' Album of the Year category was heavily criticized by the journalism community, West blamed himself for releasing Watch the Throne, his 2011 album with Jay-Z, too soon after My Beautiful Dark Twisted Fantasy."
      },
      {
        "amazonUrl": "http://www.amazon.com/Yeezus-Kanye-West/dp/B00CV5ZPA2",
        "iTunesUrl": "https://itunes.apple.com/us/album/yeezus/id662392801",
        "mixtapeUrl": "",
        "rank": 6,
        "releaseName": "Yeezus",
        "releaseType": "Album",
        "releaseYear": "2013",
        "spotifyUrl": "https://play.spotify.com/album/0XTAmejG8F97wF5MWoVbaY",
        "description": "Yeezus is the sixth studio album by American hip hop recording artist and producer Kanye West. It was released on June 18, 2013, by Roc-A-Fella Records and Def Jam Recordings. The album received rave reviews from music critics, who considered Yeezus among West's best work and praised the different sound. However, it was met with mixed reactions from the public, with divided opinions emerging after the album had an internet leak four days before release. Yeezus debuted at number one on the Billboard 200, selling 327,000 copies in its first week of release, but sales soon diminished. It topped the charts of 30 other countries, including the United Kingdom and Australia. After less than two months of release, the album was certified gold by the RIAA."
      }
    ],
    "stageName": "Kanye West",
    "twitterUsername": "kanyewest",
    "website": "http://kanyewest.com/"
  },
  {
    "artistImage": "http://i.imgur.com/X7hOXnM.jpg",
    "birthdate": "1970-04-10",
    "birthplace": "Queens, NY",
    "cleanUrlName": "q-tip",
    "realName": "Jonathan Davis",
    "releases": [
      {
        "amazonUrl": "http://www.amazon.com/Amplified-Q-Tip/dp/B002HMHRTG",
        "iTunesUrl": "https://itunes.apple.com/us/album/amplified/id279722147",
        "mixtapeUrl": "",
        "rank": 1,
        "releaseName": "Amplified",
        "releaseType": "Album",
        "releaseYear": "1999",
        "spotifyUrl": "https://play.spotify.com/album/2SGHbXwTsuIOoAdBPsnIDW",
        "description": "Amplified is the debut solo album of American hip hop artist Q-Tip, released November 23, 1999, on Arista Records. The album was recorded following the dissolution of Q-Tip's former group, A Tribe Called Quest. Production was primarily handled by Q-Tip and J Dilla, who had previously produced for A Tribe Called Quest. The album debuted at number 28 on the U.S. Billboard 200 chart, selling 89,000 copies in its first week. On January 5, 2000, it was certified gold by the Recording Industry Association of America, for shipments of 500,000 copies in the United States. As of July 2008, Amplified has sold 675,000 copies in the U.S."
      },
      {
        "amazonUrl": "http://www.amazon.com/The-Renaissance-Q-Tip/dp/B001GRTPKC",
        "iTunesUrl": "https://itunes.apple.com/us/album/the-renaissance/id294662648",
        "mixtapeUrl": "",
        "rank": 2,
        "releaseName": "The Renaissance",
        "releaseType": "Album",
        "releaseYear": "2008",
        "spotifyUrl": "https://play.spotify.com/album/5mGIqZVosIQRNgGZqFY2cz",
        "description": "The Renaissance is the second studio album by American hip hop artist Q-Tip, released November 3, 2008, on Universal Motown Records. The Renaissance was produced primarily by Q-Tip and features guest contributions by D'Angelo, Norah Jones, Amanda Diva, and Raphael Saadiq. The album debuted at number 11 on the U.S. Billboard 200 chart, selling 34,219 copies in its first week. Upon its release, The Renaissance received acclaim from music critics, who praised Q-Tip's production aesthetic and lyricism, and earned him a Grammy Award nomination for Best Rap Album."
      },
      {
        "amazonUrl": "http://www.amazon.com/Kamaal-Abstract-Q-Tip/dp/B002FA150M",
        "iTunesUrl": "https://itunes.apple.com/us/album/kamaal-abstract-bonus-track/id328227194",
        "mixtapeUrl": "",
        "rank": 3,
        "releaseName": "Kamaal/The Abstract",
        "releaseType": "Album",
        "releaseYear": "2009",
        "spotifyUrl": "https://play.spotify.com/album/2ytFxM5btEGieFNmhY6BZO",
        "description": "Kamaal/The Abstract is the third studio album by American hip hop artist Q-Tip, released September 15, 2009, on Battery Records. The album debuted at number 77 on the U.S. Billboard 200 chart, selling 6,000 copies in its first week. Upon its release, Kamaal/The Abstract received positive reviews from most music critics."
      }
    ],
    "stageName": "Q-Tip",
    "twitterUsername": "QtipTheAbstract",
    "website": "http://qtiponline.com/"
  },
  {
    "artistImage": "http://i.imgur.com/GctwXHj.jpg",
    "birthdate": "1982-09-27",
    "birthplace": "New Orleans, Louisiana",
    "cleanUrlName": "lil-wayne",
    "realName": "Dwayne Michael Carter, Jr.",
    "releases": [
      {
        "amazonUrl": "http://www.amazon.com/Tha-Block-Hot-Lil-Wayne/dp/B00002MYVJ",
        "iTunesUrl": "https://itunes.apple.com/us/album/tha-block-is-hot/id318625144",
        "mixtapeUrl": "",
        "rank": 1,
        "releaseName": "Tha Block Is Hot",
        "releaseType": "Album",
        "releaseYear": "1999",
        "spotifyUrl": "https://play.spotify.com/album/75s3OxagI6DX8OKLKymPLN",
        "description": "Tha Block Is Hot is the debut studio album by Lil Wayne that was released on November 2, 1999 by Cash Money Records. The album debuted at number three on the US Billboard 200 chart, with 229,000 copies sold in its first week released, and over 117,000 copies in its second week. The album was certified Platinum by the Recording Industry Association of America (RIAA) for sales of one million copies in the US, and has sold about 1.3 million copies."
      },
      {
        "amazonUrl": "http://www.amazon.com/Lights-Out-Lil-Wayne/dp/B000053UDL",
        "iTunesUrl": "",
        "mixtapeUrl": "",
        "rank": 2,
        "releaseName": "Lights Out",
        "releaseType": "Album",
        "releaseYear": "2000",
        "spotifyUrl": "",
        "description": "Lights Out is the second studio album by American rapper Lil Wayne, released December 19, 2000 on Cash Money Records. The album debuted at #16 on Billboard 200 and #2 on the R&B/Hip-Hop Albums charts for sales of 116,000 copies its first week released, and has since been certified Gold by RIAA. As of September 7, 2011, the album has sold 910,218 copies."
      },
      {
        "amazonUrl": "http://www.amazon.com/500-Degreez-Explicit-Version-Wayne/dp/B000V6AEZE",
        "iTunesUrl": "https://itunes.apple.com/us/album/500-degreez/id13660396",
        "mixtapeUrl": "",
        "rank": 3,
        "releaseName": "500 Degreez",
        "releaseType": "Album",
        "releaseYear": "2002",
        "spotifyUrl": "https://play.spotify.com/album/1bBRCQgqsiAlbWrDZp5tDf",
        "description": "500 Degreez is the third studio album by American rapper Lil Wayne, released July 23, 2002 on Cash Money Records. The album peaked at number six on the U.S. Billboard 200 chart and peaked at number one on the Billboard Top R&B/Hip Hop Albums chart, with 103,000 copies sold in its first week. The album has been certified gold by the RIAA and, as of September 7, 2011, has sold 584,179 copies."
      },
      {
        "amazonUrl": "http://www.amazon.com/Tha-Carter-Lil-Wayne/dp/B00027JYPI",
        "iTunesUrl": "https://itunes.apple.com/us/album/tha-carter/id13336018",
        "mixtapeUrl": "",
        "rank": 4,
        "releaseName": "Tha Carter",
        "releaseType": "Album",
        "releaseYear": "2004",
        "spotifyUrl": "https://play.spotify.com/album/5POcKy926GgzFHZpGptJac",
        "description": "Tha Carter is the fourth studio album by American rapper Lil Wayne. It was released on June 29, 2004 on Cash Money Records and Universal Records. The album debuted at number five on the US Billboard 200, and number two on the Billboard Top R&B/Hip-Hop Albums chart with 116,000 copies sold in its first week. The album was certified Platinum by the Recording Industry Association of America."
      },
      {
        "amazonUrl": "http://www.amazon.com/Tha-Carter-2-Lil-Wayne/dp/B000BLI4UG",
        "iTunesUrl": "https://itunes.apple.com/us/album/tha-carter-ii/id98017295",
        "mixtapeUrl": "",
        "rank": 5,
        "releaseName": "Tha Carter II",
        "releaseType": "Album",
        "releaseYear": "2005",
        "spotifyUrl": "https://play.spotify.com/album/0d20RT5sOfbLsBKPCTNx4s",
        "description": "Tha Carter II is the fifth studio album by American rapper Lil Wayne, released on December 6, 2005, by Cash Money, Young Money, and Universal. Upon its release, Tha Carter II received generally favorable reviews from music critics, who complimented its musical progression from his previous albums. The album peaked at number two on the U.S. Billboard 200 for first week sales of over 254,000 copies."
      },
      {
        "amazonUrl": "http://www.amazon.com/Like-Father-Son-Birdman/dp/B000HT35SS",
        "iTunesUrl": "https://itunes.apple.com/us/album/like-father-like-son/id203314334",
        "mixtapeUrl": "",
        "rank": 6,
        "releaseName": "Like Father, Like Son",
        "releaseType": "Album",
        "releaseYear": "2006",
        "spotifyUrl": "https://play.spotify.com/album/0riHF8KigcDZdKmUsZXEeo",
        "description": "Like Father, Like Son is a collaborative studio album by Birdman and Lil Wayne. The album was released on October 31, 2006, through Cash Money Records and Universal Records. Like Father, Like Son debuted at number three on the Billboard 200 chart with 176,000 copies sold in its first week. As of July 11, 2007, it has sold 761,958 copies in the United States."
      },
      {
        "amazonUrl": "http://www.amazon.com/Tha-Carter-III-Lil-Wayne/dp/B001E4IY3Q",
        "iTunesUrl": "https://itunes.apple.com/us/album/tha-carter-iii/id287818308",
        "mixtapeUrl": "",
        "rank": 7,
        "releaseName": "Tha Carter III",
        "releaseType": "Album",
        "releaseYear": "2008",
        "spotifyUrl": "https://play.spotify.com/album/1Do3y8IAcbYOToYQJnGwSO",
        "description": "Tha Carter III is the sixth studio album by American rapper Lil Wayne, released on June 10, 2008, by Cash Money and Universal Motown. Amid release delays and leaks, Tha Carter III became one of the most anticipated releases of 2008. The album debuted at number one on the US Billboard 200 chart, selling 1,005,545 copies in its first week. It reached sales of 2.88 million copies by the end of 2008 and produced four singles that achieved chart success. Tha Carter III received acclaim from music critics upon its release and earned Lil Wayne several accolades. It has been certified triple-platinum by the Recording Industry Association of America and has sold 3.6 million copies in the United States."
      },
      {
        "amazonUrl": "http://www.amazon.com/Rebirth-Lil-Wayne/dp/B001TD1XWG",
        "iTunesUrl": "https://itunes.apple.com/us/album/rebirth-deluxe-version/id350833659",
        "mixtapeUrl": "",
        "rank": 8,
        "releaseName": "Rebirth",
        "releaseType": "Album",
        "releaseYear": "2010",
        "spotifyUrl": "https://play.spotify.com/album/2ydmGsz8W6qDq2UgotdxzR",
        "description": "Rebirth is the seventh studio album by American rapper Lil Wayne, released February 2, 2010, on Cash Money Records, Young Money Entertainment and Universal Motown. The album debuted at number two on the US Billboard 200 chart, selling 176,000 copies in its first week. It became Wayne's seventh top-ten album in the United States and produced four singles that attained Billboard chart success. Upon its release, Rebirth received generally negative reviews from most music critics. It has been certified gold in sales by the Recording Industry Association of America, with domestic shipment of 500,000 copies."
      },
      {
        "amazonUrl": "http://www.amazon.com/Am-Not-Human-Being/dp/B00437DYLI",
        "iTunesUrl": "https://itunes.apple.com/us/album/i-am-not-a-human-being/id402749131",
        "mixtapeUrl": "",
        "rank": 9,
        "releaseName": "I Am Not a Human Being",
        "releaseType": "Album",
        "releaseYear": "2010",
        "spotifyUrl": "https://play.spotify.com/album/6Pqlfg42Sc3ElNuyt5NUiK",
        "description": "I Am Not a Human Being is the eighth studio album by American rapper Lil Wayne. Upon its release, I Am Not a Human Being received generally favorable reviews from music critics, who drew comparisons to Wayne's earlier work. The album debuted at number two on the U.S. Billboard 200, based on its first-week digital sales alone. Following its physical release, it topped the chart, becoming Lil Wayne's second US number-one album and the first studio album since Tupac Shakur's Me Against the World in 1995 to reach the top slot on the Billboard 200 while its artist was jailed. The album has been certified Gold by the Recording Industry Association of America."
      },
      {
        "amazonUrl": "http://www.amazon.com/Tha-Carter-IV-Lil-Wayne/dp/B004R0MF0W",
        "iTunesUrl": "https://itunes.apple.com/us/album/tha-carter-iv-deluxe-edition/id459904774",
        "mixtapeUrl": "",
        "rank": 10,
        "releaseName": "Tha Carter IV",
        "releaseType": "Album",
        "releaseYear": "2011",
        "spotifyUrl": "https://play.spotify.com/album/7oc6i8xUILaWwQ5BJMZS3c",
        "description": "Tha Carter IV is the ninth studio album by American rapper Lil Wayne, released on August 29, 2011 through Young Money Entertainment, Cash Money Records and Universal Republic Records. Tha Carter IV achieved first week sales of 964,000 copies in the United States and became Lil Wayne's second album to top the US Billboard 200 in its first week. The album received generally mixed reviews from music critics, who were divided in their responses towards the album's production and Wayne's own performances on the album: they felt it a disappointment compared to his previous work."
      },
      {
        "amazonUrl": "http://www.amazon.com/Am-Not-Human-Being-II/dp/B00BDZV9M4",
        "iTunesUrl": "https://itunes.apple.com/us/album/i-am-not-human-being-ii-deluxe/id620476823",
        "mixtapeUrl": "",
        "rank": 11,
        "releaseName": "I Am Not a Human Being II",
        "releaseType": "Album",
        "releaseYear": "2013",
        "spotifyUrl": "https://play.spotify.com/album/6Pqlfg42Sc3ElNuyt5NUiK",
        "description": "I Am Not a Human Being II is the tenth studio album by American rapper Lil Wayne, released on March 26, 2013 in the US, by Young Money Entertainment, Cash Money Records, and Republic Records. Upon its release, the album received generally mixed reviews from music critics, who criticized its production and panned Wayne's lyrics. The album debuted at number two on the Billboard 200 with 217,000 copies sold in its first week. As of July 30, 2013 the album has sold 529,000 copies in the United States."
      },
      {
        "amazonUrl": "",
        "iTunesUrl": "",
        "mixtapeUrl": "http://www.datpiff.com/Lil-Wayne-Da-Drought-mixtape.14663.html",
        "rank": 12,
        "releaseName": "Da Drought",
        "releaseType": "Mixtape",
        "releaseYear": "2003",
        "spotifyUrl": "",
        "description": "Da Drought is an official mixtape by Lil Wayne, which was released in 2003. There are a total of 12 tracks on the tape and it is the first mixtape in the Da Drought trilogy."
      },
      {
        "amazonUrl": "",
        "iTunesUrl": "",
        "mixtapeUrl": "http://www.datpiff.com/Lil-Wayne-Da-Drought-2-mixtape.14546.html",
        "rank": 13,
        "releaseName": "Da Drought 2",
        "releaseType": "Mixtape",
        "releaseYear": "2004",
        "spotifyUrl": "",
        "description": "Da Drought 2 is an official mixtape by Lil Wayne, which was released in 2004. There are a total of 15 tracks on the tape and it is the second mixtape in the Da Drought trilogy."
      },
      {
        "amazonUrl": "",
        "iTunesUrl": "",
        "mixtapeUrl": "http://www.datpiff.com/Lil-Wayne-The-Prefix-mixtape.1800.html",
        "rank": 14,
        "releaseName": "The Prefix",
        "releaseType": "Mixtape",
        "releaseYear": "2004",
        "spotifyUrl": "",
        "description": "The Prefix is an official mixtape by Lil Wayne, which was released in 2004 with a total of 13 tracks."
      },
      {
        "amazonUrl": "",
        "iTunesUrl": "",
        "mixtapeUrl": "http://www.datpiff.com/Lil-Wayne-The-Suffix-mixtape.406.html",
        "rank": 15,
        "releaseName": "The Suffix",
        "releaseType": "Mixtape",
        "releaseYear": "2005",
        "spotifyUrl": "",
        "description": "The Suffix is an official mixtape by Lil Wayne hosted by DJ Khaled. The tape was released in 2005 with a total of 18 tracks"
      },
      {
        "amazonUrl": "",
        "iTunesUrl": "",
        "mixtapeUrl": "http://www.datpiff.com/Lil-Wayne-The-Dedication-mixtape.51.html",
        "rank": 16,
        "releaseName": "The Dedication",
        "releaseType": "Mixtape",
        "releaseYear": "2005",
        "spotifyUrl": "",
        "description": "The Dedication is a mixtape by DJ Drama and Lil Wayne released December 13, 2005. It is the first mixtape in the Dedication/Gangsta Grillz Tetralogy and it was produced and hosted by DJ Drama. The mixtape was given its name because as Wayne explains in the track Intro, it is dedicated to everyone around the world and to the fallen soldiers. The mixtape currently holds a rating of 5 stars (based on over 500 ratings) on DatPiff and has generated over 200,000 downloads. The mixtape has been described as a classic among Wayne fans."
      },
      {
        "amazonUrl": "",
        "iTunesUrl": "",
        "mixtapeUrl": "http://www.datpiff.com/Lil-Wayne-The-Dedication-2-mixtape.799.html",
        "rank": 17,
        "releaseName": "Dedication 2",
        "releaseType": "Mixtape",
        "releaseYear": "2006",
        "spotifyUrl": "",
        "description": "Dedication 2 is a 2006 mixtape by DJ Drama and Lil Wayne. It is a sequel to Lil Wayne's previous mixtape, The Dedication, and is second in DJ Drama's Gangsta Grillz series with Lil Wayne. It is one of the few mixtapes in the hip hop genre to be both financially successful and critically acclaimed. Despite its illegal use of unlicensed instrumentals and samples, it is sold through iTunes and retail stores such as Best Buy and FYE, widely reviewed in the mainstream media, and even though a mixtape that almost only exclusively sold digitally it peaked at #69 on Billboard's 'Top R&B/Hip-Hop Albums' chart."
      },
      {
        "amazonUrl": "",
        "iTunesUrl": "",
        "mixtapeUrl": "http://www.datpiff.com/Lil-Wayne-Da-Drought-3-Disc-1-mixtape.4313.html",
        "rank": 18,
        "releaseName": "Da Drought 3",
        "releaseType": "Mixtape",
        "releaseYear": "2007",
        "spotifyUrl": "",
        "description": "Da Drought 3 is a two-disc mixtape by Lil Wayne, released on April 13, 2007 and is the third in the trilogy of mixtapes in Da Drought series. Da Drought 3 was hailed as the best mixtape of 2007 by MTV News. Lil Wayne was officially named The 'Hottest MC' by their hip hop brain trust. The album was #27 on Rolling Stone's list of the Top 50 Albums of 2007. Online music magazine Pitchfork Media placed Da Drought 3 at number 99 on their list of top 200 albums of the 2000s."
      },
      {
        "amazonUrl": "",
        "iTunesUrl": "",
        "mixtapeUrl": "http://www.datpiff.com/Lil-Wayne-Dedication-3-mixtape.23950.html",
        "rank": 19,
        "releaseName": "Dedication 3",
        "releaseType": "Mixtape",
        "releaseYear": "2008",
        "spotifyUrl": "",
        "description": "Dedication 3 is a mixtape by DJ Drama and Lil Wayne. It is the sequel to its predecessors, The Dedication and the highly successful Dedication 2, becoming the third in Lil Wayne's Gangsta Grillz tetralogy. Although Dedication 3 was a major success, it failed to match that of its predecessors but did gain some attention. The mixtape has sold over 70,000 copies in the United States, despite being available for free download. Besides the interludes, a majority of the mixtape has Wayne using auto-tune and rapping alongside artists signed to his label, Young Money Entertainment."
      },
      {
        "amazonUrl": "",
        "iTunesUrl": "",
        "mixtapeUrl": "http://www.datpiff.com/Lil-Wayne-No-Ceilings-mixtape.75250.html",
        "rank": 20,
        "releaseName": "No Ceilings",
        "releaseType": "Mixtape",
        "releaseYear": "2009",
        "spotifyUrl": "",
        "description": "No Ceilings is a mixtape by rap artist Lil Wayne. It was scheduled to be released on October 31, 2009, but was leaked before the official date. No Ceilings was officially released on October 31 (Halloween), with 4 additional tracks. The mixtape is available as a free and legal download."
      },
      {
        "amazonUrl": "",
        "iTunesUrl": "",
        "mixtapeUrl": "http://www.datpiff.com/Lil-Wayne-Sorry-4-The-Wait-mixtape.250654.html",
        "rank": 21,
        "releaseName": "Sorry 4 the Wait",
        "releaseType": "Mixtape",
        "releaseYear": "2011",
        "spotifyUrl": "",
        "description": "Sorry 4 the Wait is a mixtape by rapper Lil Wayne, named Sorry 4 the Wait as an attempt to apologize for the continued delay of his ninth album Tha Carter IV. Wayne said the mixtape would have about 10 songs and be similar to No Ceilings, with him using other artists' tracks and making a cover track. It was released for digital download on July 13, 2011."
      },
      {
        "amazonUrl": "",
        "iTunesUrl": "",
        "mixtapeUrl": "http://www.datpiff.com/Lil-Wayne-Dedication-4-mixtape.385544.html",
        "rank": 22,
        "releaseName": "Dedication 4",
        "releaseType": "Mixtape",
        "releaseYear": "2012",
        "spotifyUrl": "",
        "description": "Dedication 4 is a mixtape by Lil Wayne. The mixtape was originally supposed to be released on August 15, 2012, but got pushed several times and was released on September 3, 2012. It is the fourth installment of Lil Wayne's Dedication series, following its predecessors The Dedication, Dedication 2 and Dedication 3. It's also the fourth installment of Lil Wayne's Gangsta Grillz tetralogy."
      },
      {
        "amazonUrl": "",
        "iTunesUrl": "",
        "mixtapeUrl": "http://www.datpiff.com/Lil-Wayne-Dedication-5-mixtape.525016.html",
        "rank": 23,
        "releaseName": "Dedication 5",
        "releaseType": "Mixtape",
        "releaseYear": "2013",
        "spotifyUrl": "",
        "description": "Dedication 5 is a mixtape by Lil Wayne, released on September 1, 2013. It is the fifth installment of Lil Wayne's Dedication series, following its predecessors The Dedication, Dedication 2, Dedication 3 and Dedication 4. It's also the fifth installment of Lil Wayne's Gangsta Grillz Pentalogy. "
      }
    ],
    "stageName": "Lil Wayne",
    "twitterUsername": "LilTunechi",
    "website": "http://lilwayne-online.com/"
  },
  {
    "artistImage": "http://i.imgur.com/UT9F0Sv.jpg",
    "birthdate": "1984-01-30",
    "birthplace": "Cleveland, OH",
    "cleanUrlName": "kid-cudi",
    "realName": "Scott Mescudi",
    "releases": [
      {
        "amazonUrl": "http://www.amazon.com/Man-Moon-Combo-Deluxe-Edition/dp/B002FOQY04",
        "iTunesUrl": "https://itunes.apple.com/us/album/man-on-moon-end-day-expanded/id330339468",
        "mixtapeUrl": "",
        "rank": 1,
        "releaseName": "Man on the Moon",
        "releaseType": "Album",
        "releaseYear": "2009",
        "spotifyUrl": "https://play.spotify.com/album/6oPPKtAwNNlkW4wwHfQDfM",
        "description": "Man on the Moon: The End of Day is the debut studio album by American hip hop recording artist Kid Cudi, released on September 14, 2009, by Dream On, GOOD Music, and Universal Motown. The album debuted at number four on both the US Billboard 200 and Billboard Top Rap Albums chart, selling 104,000 copies in its first week of release in the United States. It later became certified Gold by the Recording Industry Association of America (RIAA), for shipments exceeding 500,000 copies in the US. Outside of the US, the album was less commercially successful, generally peaking outside of the top fifty positions of album charts."
      },
      {
        "amazonUrl": "http://www.amazon.com/Man-On-The-Moon-Legend/dp/B003P2VGN0",
        "iTunesUrl": "https://itunes.apple.com/us/album/man-on-moon-vol.-ii-legend/id401679959",
        "mixtapeUrl": "",
        "rank": 2,
        "releaseName": "Man on the Moon II",
        "releaseType": "Album",
        "releaseYear": "2010",
        "spotifyUrl": "https://play.spotify.com/album/08eM9GRdr5BCCHNqS3Wwud",
        "description": "Man on the Moon II: The Legend of Mr. Rager is the second studio album by American recording artist Kid Cudi, released November 9, 2010 under GOOD Music and Universal Motown. The album debuted at number three on the US Billboard 200 chart, selling 169,000 copies during its first week of release. Upon its release, it received generally positive reviews from music critics. On July 26, 2012, it was certified gold by the Recording Industry Association of America, for shipments of 500,000 copies in the United States."
      },
      {
        "amazonUrl": "",
        "iTunesUrl": "",
        "mixtapeUrl": "http://www.datpiff.com/KiD-CuDi-A-Kid-Named-Cudi-mixtape.28404.html",
        "rank": 3,
        "releaseName": "A Kid Named Cudi",
        "releaseType": "Mixtape",
        "releaseYear": "2008",
        "spotifyUrl": "",
        "description": "A Kid Named Cudi is a mixtape by Cleveland, OH rapper Kid Cudi released on July 17, 2008. It was produced by Plain Pat and Emile. It has received critical acclaim and features the hit single “Day ‘n’ Nite”. It features Washington, D.C. rapper Wale and Cleveland, Ohio rapper Chip Tha Ripper."
      },
      {
        "amazonUrl": "http://www.amazon.com/Indicud-Kid-Cudi/dp/B00BYISRBG",
        "iTunesUrl": "https://itunes.apple.com/us/album/indicud/id626561637",
        "mixtapeUrl": "",
        "rank": 4,
        "releaseName": "Indicud",
        "releaseType": "Album",
        "releaseYear": "2013",
        "spotifyUrl": "https://play.spotify.com/album/262o5a05pMUDSV2uzo5EwQ",
        "description": "Indicud is the third studio album by American hip hop recording artist Kid Cudi. The album was released on April 16, 2013 under Wicked Awesome Records, GOOD Music and Republic Records. It was the first album of Cudi's solo career to not be an installment of his Man on the Moon series. Indicud debuted at #2 in the US with sales of 140,000 copies and debuted at number 32 on the UK Albums Chart, becoming Cudi's highest-charting album on the chart, while entering at number 2 on the UK R&B Chart. The album received mixed to positive reviews from the majority of music critics upon its release."
      }
    ],
    "stageName": "Kid Cudi",
    "twitterUsername": "ducidni",
    "website": "http://kidcudi.com/"
  }
]
